{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,784],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"Dense","config":{"units":36,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Softmax","config":{"axis":1,"name":"softmax_Softmax1","trainable":true}}]},"keras_version":"tfjs-layers 3.19.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.19.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[784,36],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[36],"dtype":"float32"}]}]}